[
  {
    "name": "Work History",
    "icon": "fa fa-briefcase",
    "cards": [
      {
        "year": "2020",
        "name": "TransferWise Ltd",
        "role": "Frontend Developer",
        "description": "",
        "resources": [
          {
            "icon": "fa fa-calendar",
            "name": "April 2020 - present"
          },
          {
            "icon": "fa fa-map-marker",
            "name": "London, United Kingdom"
          },
          {
            "icon": "fa fa-external-link",
            "name": "Wise (formerly TransferWise) website",
            "url": "https://wise.com/"
          }
        ]
      },
      {
        "year": "2018",
        "name": "Nutmeg Saving And Investment Limited",
        "role": "Software Engineer",
        "description": "<p>Joined into the early development of our atomic design system using React and SASS (with BEM). We also put extra effort into making all of our components fully accessible by W3C standards. Used Lerna to release new versions of components to our private npm repository. This design system is the core of every new UI at Nutmeg.</p><p>Rewrote pages within the sign-up and existing customer flows, using our component design system to create the UI, redux for handling & storing data, redux-sagas as side effect to fetch data from our REST APIs, and xstate as state machine for journey navigation.</p><p>Wrote an internal documentation about “pipeline management with Jenkins”, so new engineers can pick up our CI/CD much quicker with in-house examples.</p><p>Cross-team code reviews to ensure we uphold our coding practices, accessibility, and that we continue with TDD/BDD mentality with one-hundred percent unit test coverage across all React applications within the business.</p><p>Worked on our internal screens for CS & Operations using React, Redux, and React Bootstrap.</p><p>Migrated several pages from our legacy Ruby on Rails application to React.</p>",
        "resources": [
          {
            "icon": "fa fa-calendar",
            "name": "March 2018 - April 2020"
          },
          {
            "icon": "fa fa-map-marker",
            "name": "London, United Kingdom"
          },
          {
            "icon": "fa fa-external-link",
            "name": "Nutmeg website",
            "url": "https://www.nutmeg.com/"
          }
        ]
      },
      {
        "year": "2017",
        "name": "TalkTalk Group Plc.",
        "role": "Product Developer (Angular)",
        "description": "<p>Worked on the TalkTalk web shop using AngularJS, OOP JavaScript (ES6), and Bootstrap.</p><p>Maintained and improved E2E pipelines using Selenium WebDriver, so our tests became more stable & reliable.</p><p>Increased conversion rates by developing a new sales journey and A/B testing it.</p><p>Developed responsive pages for new products & promotions.</p>",
        "resources": [
          {
            "icon": "fa fa-calendar",
            "name": "May 2017 - March 2018"
          },
          {
            "icon": "fa fa-map-marker",
            "name": "London, United Kingdom"
          },
          {
            "icon": "fa fa-external-link",
            "name": "TalkTalk website",
            "url": "https://www.talktalk.co.uk/shop/"
          }
        ]
      },
      {
        "year": "2015",
        "name": "SAM Labs Ltd.",
        "role": "Junior Software Developer",
        "description": "<p>Worked on a multi platform electron application using HTML5, CSS3, SASS, AngularJS, TypeScript (later on ES6), and Foundation.</p><p>Completely rewrote the company website and its web shop using Elixir EEx, RethinkDB and JavaScript Custom Elements. Later on integrated the custom web shop with Shopify.</p><p>Created an CMS panel for the marketing site with Choo and Elixir, so copy changes could be done without input from the engineering team.</p><p>Worked on API integrations between Xero, Unleashed, SalesForce, and Horizon to automate the flow of orders from the point of sale until the shipment confirmation.</p><p>Developed a control panel with React and Redux to track the status of orders.</p>",
        "resources": [
          {
            "icon": "fa fa-calendar",
            "name": "August 2015 - April 2017"
          },
          {
            "icon": "fa fa-map-marker",
            "name": "London, United Kingdom"
          },
          {
            "icon": "fa fa-external-link",
            "name": "SAM Labs website",
            "url": "https://www.samlabs.com/"
          }
        ]
      }
    ]
  },
  {
    "name": "Project History",
    "icon": "fa fa-book",
    "cards": [
      {
        "year": "2019",
        "name": "MyBlizzCon",
        "description": "Created a trading website so people going to BlizzCon 2019 convention, can find a partner to trade their commemorative statues with. React, React Router, and SASS  was used on the frontend. NodeJS, Express and MongoDB was used on the backend.",
        "resources": [
          {
            "icon": "fa fa-calendar",
            "name": "November 2019"
          },
          {
            "icon": "fa fa-map-marker",
            "name": "London, United Kingdom"
          },
          {
            "icon": "fa fa-external-link",
            "name": "Demo",
            "url": "https://rerdos.github.io/myblizzcon"
          }
        ]
      },
      {
        "year": "2019",
        "name": "How Much ETH",
        "description": "During a single weekend challange, I have implemented an Ethereum (cryptocurrency) payment system, where people could pay the equivalent of $1.49 to see how many people paid this amount in total. I used React and Redux on FE side and NodeJS and MongoDB on the backend side.",
        "resources": [
          {
            "icon": "fa fa-calendar",
            "name": "January 2019"
          },
          {
            "icon": "fa fa-map-marker",
            "name": "London, United Kingdom"
          },
          {
            "icon": "fa fa-external-link",
            "name": "Demo",
            "url": "https://rerdos.github.io/howmucheth"
          }
        ]
      },
      {
        "year": "2017",
        "name": "My Portfolio",
        "description": "A static portfolio website that allows its owner to display any achievement or important point in his/her life, like work history or/and project history. Furthermore a sidebar is included where that person can highlight his/her skills, spoken languages and the place where he/she is located. This static page was built with by AngularJS 1.6, ES6, and SASS. Webpack 2 was used as module bundler to generate builds.",
        "resources": [
          {
            "icon": "fa fa-calendar",
            "name": "June 2017"
          },
          {
            "icon": "fa fa-map-marker",
            "name": "London, United Kingdom"
          },
          {
            "icon": "fa fa-smile-o",
            "name": "You are looking at the demo"
          },
          {
            "icon": "fa fa-github",
            "name": "rerdos/my-portfolio",
            "url": "https://github.com/rerdos/my-portfolio"
          }
        ]
      },
      {
        "year": "2015",
        "name": "MyMiniFactory",
        "description": "AngularJS application that requests 3D objects's data from a locally provided JSON file, then applies it into a fully responsive website with a simple search option that is powered by Angular filters. Furthermore, a modal has been applied from Angular Foundation library in order to bring more interactivity to the website. Responsive design was provided by Foundation library. Bower was used in order to manage AngularJS, Foundation and Angular-foundation libraries during and after the development.",
        "resources": [
          {
            "icon": "fa fa-calendar",
            "name": "July 2015"
          },
          {
            "icon": "fa fa-map-marker",
            "name": "London, United Kingdom"
          },
          {
            "icon": "fa fa-external-link",
            "name": "Demo",
            "url": "https://rerdos.github.io/myminifactory"
          }
        ]
      },
      {
        "year": "2015",
        "name": "Final Exam",
        "description": "Single page application that calculates how many points the student must earn in order to get the better grade in the end of the Hungarian school leaving exam. This application has been developed in AngularJS. Data that the user has provided is stored in the LocalStorage, so users don't have to input their data each time when they visit the website. It contains Bootstrap in order to normalize the webpage (so it will appear the same in every browser) and to have predesigned alert boxes.",
        "resources": [
          {
            "icon": "fa fa-calendar",
            "name": "June 2015"
          },
          {
            "icon": "fa fa-map-marker",
            "name": "Hungary"
          },
          {
            "icon": "fa fa-external-link",
            "name": "Demo",
            "url": "https://rerdos.github.io/finalexam"
          }
        ]
      },
      {
        "year": "2015",
        "name": "Todos",
        "description": "A simple ‘todo’ application that allows its users to add, delete or edit a new or existing to do. Interactivity is provided by AngularJS. The design of alert boxes, lists and buttons as well its responsive design come from Bootstrap framework.",
        "resources": [
          {
            "icon": "fa fa-calendar",
            "name": "June 2015"
          },
          {
            "icon": "fa fa-map-marker",
            "name": "Hungary"
          },
          {
            "icon": "fa fa-external-link",
            "name": "Demo",
            "url": "https://rerdos.github.io/todo"
          }
        ]
      }
    ]
  }
]
